In [1]:
import pandas as pd
import numpy as np

# 1.Series间的对齐运算：

In [2]:
s1 = pd.Series([1,2,3,4],index=["a", "c", "d", "e"])

In [3]:
s1

a    1
c    2
d    3
e    4
dtype: int64

In [4]:
s2 = pd.Series([5,6,7,8,9],index=["a", "c", "e", "f", "g"])

In [5]:
s2

a    5
c    6
e    7
f    8
g    9
dtype: int64

In [6]:
s1 + s2

a     6.0
c     8.0
d     NaN
e    11.0
f     NaN
g     NaN
dtype: float64

# 2.DataFrame间的对齐运算：

In [7]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=['a','b','c'],index=['行1','行2','行3'])
df1

    a  b  c
行1  0  1  2
行2  3  4  5
行3  6  7  8

In [8]:
df2 = pd.DataFrame(np.arange(12).reshape((4,3)),columns=['b','d','e'],index=['行4','行2','行3','行5'])
df2

    b   d   e
行4  0   1   2
行2  3   4   5
行3  6   7   8
行5  9  10  11

In [9]:
df1 + df2

     a     b   c   d   e
行1 NaN   NaN NaN NaN NaN
行2 NaN   7.0 NaN NaN NaN
行3 NaN  13.0 NaN NaN NaN
行4 NaN   NaN NaN NaN NaN
行5 NaN   NaN NaN NaN NaN

# 3.使用填充值的对齐运算：

In [10]:
df1

    a  b  c
行1  0  1  2
行2  3  4  5
行3  6  7  8

In [11]:
df2

    b   d   e
行4  0   1   2
行2  3   4   5
行3  6   7   8
行5  9  10  11

In [12]:
df1.add(df2 , fill_value=0)

      a     b    c     d     e
行1  0.0   1.0  2.0   NaN   NaN
行2  3.0   7.0  5.0   4.0   5.0
行3  6.0  13.0  8.0   7.0   8.0
行4  NaN   0.0  NaN   1.0   2.0
行5  NaN   9.0  NaN  10.0  11.0

# 4.Series和DataFrame间的对齐运算：

#### 默认情况下，DataFrame和Series间的算术操作会将Series的索引与DataFrame的列进行匹配，并广播到各行

In [13]:
dataframe = pd.DataFrame(np.arange(12).reshape((4,3)),columns=['b','d','e'],index=['行1','行2','行3','行4'])
dataframe

    b   d   e
行1  0   1   2
行2  3   4   5
行3  6   7   8
行4  9  10  11

In [14]:
series = dataframe.iloc[0]
series

b    0
d    1
e    2
Name: 行1, dtype: int32

In [15]:
dataframe - series

    b  d  e
行1  0  0  0
行2  3  3  3
行3  6  6  6
行4  9  9  9

#### 如果一个索引值不在DataFrame的列中，也不在Series的索引中，则对象会重建索引并形成联合。

In [16]:
dataframe = pd.DataFrame(np.arange(12).reshape((4,3)),columns=['b','d','e'],index=['行1','行2','行3','行4'])
dataframe

    b   d   e
行1  0   1   2
行2  3   4   5
行3  6   7   8
行4  9  10  11

In [17]:
series = pd.Series(range(3),index=['b','e','f'])
series

b    0
e    1
f    2
dtype: int64

In [18]:
dataframe + series

      b   d     e   f
行1  0.0 NaN   3.0 NaN
行2  3.0 NaN   6.0 NaN
行3  6.0 NaN   9.0 NaN
行4  9.0 NaN  12.0 NaN

#### 也可以通过传递axis值用于在列上进行广播操作。

In [19]:
dataframe = pd.DataFrame(np.arange(12).reshape((4,3)),columns=['b','d','e'],index=['行1','行2','行3','行4'])
dataframe

    b   d   e
行1  0   1   2
行2  3   4   5
行3  6   7   8
行4  9  10  11

In [20]:
series = dataframe['d']
series

行1     1
行2     4
行3     7
行4    10
Name: d, dtype: int32

In [21]:
dataframe.sub(series,axis=0)

    b  d  e
行1 -1  0  1
行2 -1  0  1
行3 -1  0  1
行4 -1  0  1